# 파이썬 in, not in을 사용한 검색 예제 
#-------------------------------------------------------
test_list = [5, 8, 10, -1, -10, 100, 50, 90, 45, 64, 7,
             9, -20, -10, -1, 0, 255, 500, -300, -256]

# 리스트  자료 출력 
print(test_list)

# in을 사용하여 리스트에 값이 포함되어 있는지 검색
if 10 in test_list:
    print("%d은(는) 포함되어 있습니다." %10)
else:
    print("%d은(는) 포함되지 않았습니다." %10)

# not in을 사용하여 리스트에 값이 포함되지 않았는지 검색
if 1000 not in test_list:
    print("%d은(는) 포함되지 않습니다." %1000)
else:
    print("%d은(는) 포함되어 있습니다." %1000)
    
