# 고급 예제 1
# 연도(1583~9999)와 월(1~12)을 입력받고 달력을 출력합니다. 

#-------------------------------------------------------------------
# 월의 날짜를 돌려주는 함수
def days_of_month(y, m):
  days_of_mon = [ 0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 ]
  if(m > 0 and m < 13):
    days_of_mon[2] = 29 if y%400 == 0 or (y%100 != 0 and y%4 == 0) else 28
    return days_of_mon[m]
  else:
    return None

#------------------------------------------------------------------
# 입력한 날짜의 요일을 구하는 함수 
# 입력값: y=년도, m=월, d=일  
# 반환값: 0=일요일, 1=월요일, 2=화요일, 3=수요일, 4=목요일, 5=금요일, 6=토요일  
def day_of_week( y, m, d): 
  t = [0, 3, 2, 5, 0, 3, 5, 1, 4, 6, 2, 4] 
  y -= m < 3 
  return ((y + y//4 - y//100 + y//400 + t[m-1] + d) % 7); 
 
#------------------------------------------------------------------
# 달력 출력 함수 
def print_cal(year, month):
  if (year < 1583 or year > 9999) or month < 1 or month > 12:
    return 1

  day = day_of_week(year, month, 1)    # 해당 월의 시작 요일 
  temp = days_of_month(year, month)    # 해당 월의 날짜 수 

  print("\n\t[%i년 %i월]" %(year, month))
  print("============================")
  print(" 일  월  화  수  목  금  토 ")
  print("----------------------------")
 
  for i in range(1, day+1):
    print("    ", end="")

  j = day
  for i in range(1, temp+1):
    if j % 7 == 0 and j != 0:      # 요일별로 출력되도록 줄바꿈 
      print("")
      j = 0
    print(" %2d " %i, end="")
    j += 1
  print("\n============================\n");
  return 0;

#-------------------------------------------------------------------
# 메인 프로세스 
    
while (1):
  y = int(input("달력의 연도를 입력하세요(1583~9999): "))
  m = int(input("달력의 월을 입력하세요(1~12): "))    
  if print_cal(y, m): 
    print("입력 오류입니다!!!")



